src/QLHocBaComApp/test/chinhsuahocba_test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp">
  <soapenv:Body>
    <qlh:chinhsuahocbaOperation>
     <id_hocba>6</id_hocba>
      <diemtrungbinh>7</diemtrungbinh>
      <lenlophaykhong>true</lenlophaykhong>
      <nhanxet>co gang hon</nhanxet>
      <id_hocluc>4</id_hocluc>
      <id_namhoc>1</id_namhoc>
      <id_hanhkiem>5</id_hanhkiem>
      <id_lop>1</id_lop>
    </qlh:chinhsuahocbaOperation>
  </soapenv:Body>
</soapenv:Envelope>