trunk/src/QLHocBaComApp/test/capnhathanhkiem_test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp" xmlns:esc="http://xml.netbeans.org/schema/EschoolinkObject">
  <soapenv:Body>
    <qlh:capnhathanhkiemOperation>
      <hocba>
        <esc:id>?10?</esc:id>
        <!--Zero or more repetitions:-->
        <esc:HocBaTungHK>
          <esc:id>7</esc:id>
          <esc:nhanXet>?string?</esc:nhanXet>

          <!--Optional:-->
          <esc:HanhKiem>

            <esc:tenHanhKiem>Tot</esc:tenHanhKiem>
            <esc:ghiChu>?string?</esc:ghiChu>
          </esc:HanhKiem>

        </esc:HocBaTungHK>


      </hocba>
    </qlh:capnhathanhkiemOperation>
  </soapenv:Body>
</soapenv:Envelope>