trunk/src/QLHocBaComApp/test/themhocsinhbohoc_test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp">
  <soapenv:Body>
    <qlh:themhocsinhbohocOperation>
      <id_hocsinh>1</id_hocsinh>
      <hocky>1</hocky>
      <lydo>Nghi</lydo>
      <ngaybohoc>2008-09-28</ngaybohoc>
    </qlh:themhocsinhbohocOperation>
  </soapenv:Body>
</soapenv:Envelope>