trunk/src/QLHocBaComApp/test/tracuuhocbacanam_test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp">
  <soapenv:Body>
    <qlh:tracuuhocbacanamOperation>
      <id_hocsinh>1</id_hocsinh>
      <namsau>2009</namsau>
      <namtruoc>2008</namtruoc>
    </qlh:tracuuhocbacanamOperation>
  </soapenv:Body>
</soapenv:Envelope>