src/QLHocBaComApp/test/xoahocsinhbohoc/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp">
  <soapenv:Body>
    <qlh:xoahocsinhbohocOperation>
      <id_hocsinh>1</id_hocsinh>
    </qlh:xoahocsinhbohocOperation>
  </soapenv:Body>
</soapenv:Envelope>