src/QLHocBaComApp/test/TracuuhbatheoHK/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp">
  <soapenv:Body>
    <qlh:TraCuuHocBaHocTheoHKOperation>
      <id_hocsinh>1</id_hocsinh>
      <hocky>2</hocky>
      <namsau>2010</namsau>
      <namtruoc>2009</namtruoc>
    </qlh:TraCuuHocBaHocTheoHKOperation>
  </soapenv:Body>
</soapenv:Envelope>