src/QLHocBaComApp/test/loadLoptheoNamvaKhoi/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp">
  <soapenv:Body>
    <qlh:loadLopTheoKhoiLopVaNamHocOperation>
      <id_namhoc>1</id_namhoc>
      <id_khoilop>1</id_khoilop>
    </qlh:loadLopTheoKhoiLopVaNamHocOperation>
  </soapenv:Body>
</soapenv:Envelope>