src/QLHocBaComApp/test/updateHocba/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlh="QLHocBaComApp">
  <soapenv:Body>
    <qlh:chinhsuahocbaOperation>
      <id_hocba>1</id_hocba>
      <diemtrungbinh>8</diemtrungbinh>
      <lenlophaykhong>false</lenlophaykhong>
      <nhanxet>asdfasdf</nhanxet>
      <id_hocluc>1</id_hocluc>
      <id_namhoc>1</id_namhoc>
      <id_hanhkiem>2</id_hanhkiem>
      <id_lop>1</id_lop>
    </qlh:chinhsuahocbaOperation>
  </soapenv:Body>
</soapenv:Envelope>